Table of Contents
 Class IdeaCrossSectionByComponents
Namespace
IdeaStatiCa.BimApiLink.BimApi
Assembly
IdeaStatiCa.BimApiLink.dll
public class IdeaCrossSectionByComponents : AbstractIdeaObject<IIdeaCrossSectionByComponents>, IEquatable<AbstractIdeaObject<IIdeaCrossSectionByComponents>>, IIdeaCrossSectionByComponents, IIdeaCrossSection, IIdeaObject
Inheritance
object
ScopeAwareObject
BimLinkObject
AbstractIdeaObject<IIdeaCrossSectionByComponents>
IdeaCrossSectionByComponents
Implements
IEquatable<AbstractIdeaObject<IIdeaCrossSectionByComponents>>
IIdeaCrossSectionByComponents
IIdeaCrossSection
IIdeaObject
Inherited Members
 AbstractIdeaObject<IIdeaCrossSectionByComponents>.Id
 AbstractIdeaObject<IIdeaCrossSectionByComponents>.Name
 AbstractIdeaObject<IIdeaCrossSectionByComponents>.Identifier
 AbstractIdeaObject<IIdeaCrossSectionByComponents>.GetHashCode()
 AbstractIdeaObject<IIdeaCrossSectionByComponents>.Equals(object)
 AbstractIdeaObject<IIdeaCrossSectionByComponents>.Equals(AbstractIdeaObject<IIdeaCrossSectionByComponents>)
 BimLinkObject.Get<T>(Identifier<T>)
 BimLinkObject.Get<T>(int)
 BimLinkObject.Get<T>(string)
 BimLinkObject.GetMaybe<T>(Identifier<T>)
 BimLinkObject.GetMaybe<T>(int)
 BimLinkObject.GetMaybe<T>(string)
 BimLinkObject.CountryCode
 BimLinkObject.UserData
 ScopeAwareObject.Scope
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Constructors
 IdeaCrossSectionByComponents(Identifier<IIdeaCrossSectionByComponents>)
public IdeaCrossSectionByComponents(Identifier<IIdeaCrossSectionByComponents> identifer)
Parameters
identifer Identifier<IIdeaCrossSectionByComponents>
 IdeaCrossSectionByComponents(int)
public IdeaCrossSectionByComponents(int id)
Parameters
id int
 IdeaCrossSectionByComponents(string)
public IdeaCrossSectionByComponents(string id)
Parameters
id string
Properties
 Components
Set of components.
public virtual HashSet<IIdeaCrossSectionComponent> Components { get; set; }
Property Value
HashSet<IIdeaCrossSectionComponent>
 IsInPrincipal
Specifies that the cross-section is in its principal axis.
public virtual bool IsInPrincipal { get; set; }
Property Value
bool
 Rotation
Rotation of the cross-section.
public virtual double Rotation { get; set; }
Property Value
double
 Edit this page